app/controllers/posts_controller.rb

  def create
    @post = Post.new(params.require(:post).permit(:title, :body))
    if @post.save
---
INSERT INTO "posts" ("body", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["body", "meh"], ["created_at", "2014-10-15 23:58:30.625391"], ["title", "test"], ["updated_at", "2014-10-15 23:58:30.625391"]]

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params.require(:post).permit(:title, :body))
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = ? LIMIT 1  [["id", 56]]
UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = 56  [["body", "Tester testy"], ["updated_at", "2014-10-16 00:18:28.099198"]]